RIET/src/Documents/ExportShipment/ExportShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ExportShipment</name>
  <basedOn>Document.ExportRequest</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedToCustoms</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleasedFromCustoms</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCDNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalFreightProvider</name>
    <type>
      <types>CatalogRef.FreightForwarders</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>POA</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>InternationalMOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>InternationalETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreAlertSent</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalETA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalATA</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWB4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InternationalWBList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>170</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportRequestsNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportSpecialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MoveITCRNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoticeOfDeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OOC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalFreightSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomUnionTransaction</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSShipmentID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportConfirmationReceived</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ExportRequests</name>
    <attributes>
      <name>ExportRequest</name>
      <type>
        <types>DocumentRef.ExportRequest</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OutOfComplianceReasons</name>
    <attributes>
      <name>OutOfComplianceReason</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/ExportShipment/ManagerModule.bsl
Функция ПолучитьItemsOfExportShipment(ExportShipment) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ExportShipment) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ExportShipment", ExportShipment);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтрокиИнвойса.Ссылка КАК СтрокаИнвойса
		|ИЗ
		|	Документ.ExportShipment.ExportRequests КАК ExportShipmentExportRequests
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтрокиИнвойса КАК СтрокиИнвойса
		|		ПО ExportShipmentExportRequests.ExportRequest = СтрокиИнвойса.ExportRequest
		|			И ((НЕ СтрокиИнвойса.ПометкаУдаления))
		|ГДЕ
		|	ExportShipmentExportRequests.Ссылка = &ExportShipment";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтрокаИнвойса");
	
КонецФункции

Функция ПолучитьExportRequestsToTMSNo(ExportShipment) Экспорт
	
	// Возвращает массив номеров Export requests, входящих в указанный Export shipment, и предназначенных для выгрузки в TMS
	
	Если НЕ ЗначениеЗаполнено(ExportShipment) Тогда
		ВызватьИсключение "Export shipment is empty!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ExportShipment", ExportShipment);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ExportRequests.Номер КАК ERNo
		|ИЗ
		|	Документ.ExportShipment.ExportRequests КАК ExportShipmentsExportRequests
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ExportRequest КАК ExportRequests
		|		ПО ExportShipmentsExportRequests.ExportRequest = ExportRequests.Ссылка
		|			И (ExportRequests.Company.StartOfExportToTMS <= ExportRequests.Submitted)
		|ГДЕ
		|	ExportShipmentsExportRequests.Ссылка = &ExportShipment";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ERNo");	
	
КонецФункции
